Revit 2018 API
Rebar.RebarShapeId Property
 The RebarShape element that defines the shape of the rebar.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 18.0.0.0 (18.0.0.0)
Since: 2013
Syntax
C#
[ObsoleteAttribute("This property is deprecated in Revit 2018 and will be removed in a future version. For getter we suggest you use GetShapeId() instead. For setter we suggest you use GetShapeDrivenAccessor().SetRebarShapeId() instead.")]
public ElementId RebarShapeId { get; set; }
Visual Basic
<ObsoleteAttribute("This property is deprecated in Revit 2018 and will be removed in a future version. For getter we suggest you use GetShapeId() instead. For setter we suggest you use GetShapeDrivenAccessor().SetRebarShapeId() instead.")> _
Public Property RebarShapeId As ElementId
	Get
	Set
Visual C++
[ObsoleteAttribute(L"This property is deprecated in Revit 2018 and will be removed in a future version. For getter we suggest you use GetShapeId() instead. For setter we suggest you use GetShapeDrivenAccessor().SetRebarShapeId() instead.")]
public:
property ElementId^ RebarShapeId {
	ElementId^ get ();
	void set (ElementId^ value);
}
Remarks
 Changing the value of this property causes the Rebar instance to choose values for its shape parameters to preserve its previous shape as closely as possible
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  When setting this property: shapeId is not the id of a RebarShape in the document.
Autodesk.Revit.Exceptions.ArgumentNullException |  When setting this property: A non-optional argument was NULL
Autodesk.Revit.Exceptions.DisabledDisciplineException |  When setting this property: None of the following disciplines is enabled: Structural.
Autodesk.Revit.Exceptions.InvalidOperationException |  When setting this property: This method applies only to shape driven rebar.
See Also
Rebar Class
Autodesk.Revit.DB.Structure Namespace